In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
#Question 1
#ANs

In [4]:
df = pd.Series([4,8,15,16,23,42])

In [5]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
#Question 2
#ans

In [7]:
list = [12,43,54,23,65,342,65,43,76,87]
df2 = pd.Series(list)

In [8]:
df2

0     12
1     43
2     54
3     23
4     65
5    342
6     65
7     43
8     76
9     87
dtype: int64

In [9]:
#Question 3
#Ans

In [10]:
data = {"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":['Female',"Male",'Female']}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
#Question 4
#ANs

In [14]:
#DataFrame: -
#In the context of the Python library pandas, a DataFrame is a 2-dimensional labeled data structure. 
#It can be thought of as a table-like data structure with rows and columns, where each column can contain data of a different type 
#(integer, string, float, etc.). It's a fundamental data structure for data analysis and manipulation in pandas.
#Series: -
#On the other hand, a Series is a 1-dimensional labeled array, essentially representing a single column of data. 
#It's a core data structure in pandas and forms the building block for a DataFrame.
import pandas as pd

In [15]:
df = pd.Series([1,4,3,2,5])

In [16]:
df

0    1
1    4
2    3
3    2
4    5
dtype: int64

In [17]:
df = pd.DataFrame({"key":[1,2,3],"key2":[4,5,6]})

In [18]:
df

   key  key2
0    1     4
1    2     5
2    3     6

In [19]:
#Question 5
#Ans

In [20]:
import pandas as pd

data = {'Name': ['Ankit', 'Bobil', 'Chirag', 'Dravid', 'Engur'],
        'Age': [25, 30, 22, 40, 28]}
df = pd.DataFrame(data)

In [21]:
df

     Name  Age
0   Ankit   25
1   Bobil   30
2  Chirag   22
3  Dravid   40
4   Engur   28

In [22]:
df.head(3)

     Name  Age
0   Ankit   25
1   Bobil   30
2  Chirag   22

In [23]:
df.tail(2)

     Name  Age
3  Dravid   40
4   Engur   28

In [24]:
df.drop(2)

     Name  Age
0   Ankit   25
1   Bobil   30
3  Dravid   40
4   Engur   28

In [25]:
df.describe()

             Age
count   5.000000
mean   29.000000
std     6.855655
min    22.000000
25%    25.000000
50%    28.000000
75%    30.000000
max    40.000000

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [27]:
df.sort_values(by="Age")

     Name  Age
2  Chirag   22
0   Ankit   25
4   Engur   28
1   Bobil   30
3  Dravid   40

In [28]:
df['Name'].apply(lambda x: x.upper())

0     ANKIT
1     BOBIL
2    CHIRAG
3    DRAVID
4     ENGUR
Name: Name, dtype: object

In [29]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [30]:
df.dtypes

Name    object
Age      int64
dtype: object

In [31]:
df['Age'].unique()

array([25, 30, 22, 40, 28])

In [32]:
#Question 6
#Ans: -
# Among the options provided, both Series and DataFrame are mutable in nature, while Panel is not. 
#However, it's important to note that the Panel class has been removed from the latest versions of pandas (versions 0.25.0 and later)

In [33]:
#QUestion 7
#Ans

In [34]:
import pandas as pd

In [35]:
name = pd.Series(["Akshay","Ankit","Ashish","Ayush","Rohit"])

In [36]:
age = pd.Series([27,22,30,21,23])

In [37]:
gender = pd.Series(["Male","Male","Male","Male","Male"])

In [38]:
df = pd.DataFrame({"Name":name,"Age":age,"Gender":gender})

In [39]:
df

     Name  Age Gender
0  Akshay   27   Male
1   Ankit   22   Male
2  Ashish   30   Male
3   Ayush   21   Male
4   Rohit   23   Male